## pandas 불러오기

## users.data 불러오기

## ratings.data 불러오기

## users.dat와 ratings.dat를 inner join 해주세요

## inner join한 데이터의 처음 10개 행을 출력해주세요

## 타임스탬프 column을 삭제해주세요

## 총 사용자가 몇명이고 영화에 가장 많은 평점을 부여한 5명을 찾아주세요

## 각 직업마다의 영화 평균 평점을 구한 데이터프레임을 만들어주세요

In [2]:
# 아래와 같은 데이터 프레임 결과를 만들어주세요
# 코드 작성은 아래 셀에서 해주세요

    직업        평점
0    0  3.537544
1    1  3.576642
2    2  3.573081
3    3  3.656516
4    4  3.536793
5    5  3.537529
6    6  3.661578
7    7  3.599772
8    8  3.466741
9    9  3.656589
10  10  3.532675
11  11  3.617371
12  12  3.654001
13  13  3.781736
14  14  3.618481
15  15  3.689774
16  16  3.596575
17  17  3.613574
18  18  3.530117
19  19  3.414050
20  20  3.497392

## 영화 id 특정 번호 사이의 평점 평균 구해보기(함수를 통해서) 
### between_rating_mean이라는 함수를 만들어서 아래와 같은 출력 값이 나와야 합니다!
### 밑에 3.51127값은 영화 id가 10~20(20포함)인 평점의 평균을 구한 값입니다

In [3]:
# 여기 있는 셀은 건드리지 마세요!
# 아래 셀에서 작성해주세요
between_rating_mean(10, 20)

3.5112717992343683